DataProcessors/РедактированиеПараметровДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>РедактированиеПараметровДоставки</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СпособУказанияДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыУказанияДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПланированияДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПланированияДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыДоставки25</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоставкаДоПеревозчика</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаДоставкиПеревозчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаДоставкиПеревозчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяДоставкиС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяДоставкиПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформацияПоДоставке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобыеУсловияПеревозки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобыеУсловияПеревозкиОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курьер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТоварыКДоставке</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>9</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикиИспользуются</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособДоставки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыДоставки25</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаДоставки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТочкиДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗонаДоставки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоставкаДоПеревозчика</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Перевозчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаДоставкиПеревозчика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТочкиДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗонаДоставкиПеревозчика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяДоставкиС</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяДоставкиПо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительнаяИнформацияПоДоставке</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсобыеУсловияПеревозки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсобыеУсловияПеревозкиОписание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтгрузки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Склады</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаСклада</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТочкиДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗонаСклада</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МногооборотнаяТара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыДоставки25.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыДоставки25</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Самовывоз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НашимиСилами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СиламиПеревозчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НашКурьер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОпределяетСлужбаДоставки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыУказанияДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыУказанияДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаВесьДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСтрокам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыПланированияДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыПланированияДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТекущимДокументом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтдельнымДокументом</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/РедактированиеПараметровДоставки/Forms/ПараметрыДоставки/Ext/Form/Module.bsl
// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастройкиДоставки = ДоставкаТоваровКлиентСервер.НовыеПараметрыНастройкиДоставки();
	
	Если НЕ Параметры.Свойство("НастройкиДоставки", НастройкиДоставки) Тогда
		
		ТекстИсключения = НСтр("ru = 'В форму настроек доставки не передан обязательный параметр ""Настройки доставки"".
							   |Обратитесь к администратору.'");
		ВызватьИсключение ТекстИсключения;
		
	КонецЕсли;
	
	Объект.Партнер = НастройкиДоставки.Партнер;
	
	Объект.ВидПланированияДоставки = НастройкиДоставки.ВидПланированияДоставки;
	Объект.СпособУказанияДоставки = НастройкиДоставки.СпособУказанияДоставки;
	Объект.СпособДоставки = НастройкиДоставки.СпособДоставки;
	Объект.Курьер = НастройкиДоставки.Курьер;
	Объект.ДоставкаДоПеревозчика = НастройкиДоставки.ДоставкаДоПеревозчика;
	Объект.Перевозчик = НастройкиДоставки.Перевозчик;
	Объект.ТочкаДоставкиПеревозчика = НастройкиДоставки.ТочкаДоставкиПеревозчика;
	Объект.ЗонаДоставкиПеревозчика = НастройкиДоставки.ЗонаДоставкиПеревозчика;
	Объект.ТочкаДоставки = НастройкиДоставки.ТочкаДоставки;
	Объект.ЗонаДоставки = НастройкиДоставки.ЗонаДоставки;
	ПроверитьЗаполнитьДанныеДоставкиНаВесьДокумент();
	
	Объект.ВремяДоставкиС = НастройкиДоставки.ВремяДоставкиС;
	Объект.ВремяДоставкиПо = НастройкиДоставки.ВремяДоставкиПо;
	
	Объект.ДополнительнаяИнформацияПоДоставке = НастройкиДоставки.ДополнительнаяИнформацияПоДоставке;
	Объект.ОсобыеУсловияПеревозки = НастройкиДоставки.ОсобыеУсловияПеревозки;
	Если Объект.ОсобыеУсловияПеревозки Тогда
		Объект.ОсобыеУсловияПеревозкиОписание = НастройкиДоставки.ОсобыеУсловияПеревозкиОписание;
	КонецЕсли;
	
	ПроверкаПередачиСпособовДоставки(НастройкиДоставки);
	НастроитьОграниченияСпособовДоставки(НастройкиДоставки);
	
	Для Каждого СтрокаТоваров Из НастройкиДоставки.Товары Цикл
		
		НоваяСтрока = Объект.ТоварыКДоставке.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТоваров);
		НоваяСтрока.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар;
		
	КонецЦикла;
	Объект.ТоварыКДоставке.Сортировать("НомерСтрокиДокумента");
	ПроверитьЗаполнитьДанныеДоставкиПострочно();
	
	Для Каждого СтрокаСкладов Из НастройкиДоставки.Склады Цикл
		
		НоваяСтрока = Объект.Склады.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСкладов);
		
	КонецЦикла;
	Объект.Склады.Сортировать("Склад");
	
	УстановитьФиксированнуюВидимостьДоступностьЭлементов(НастройкиДоставки);
	УстановитьВидимостьДоступностьЭлементов();
	
	Элементы.ТоварыКДоставкеДатаОтгрузки.Видимость = НЕ НастройкиДоставки.ИспользуетсяЕдинаяДатаОтгрузки;
	
	ЭлементыДляЗаполненияВремени = Новый Массив; // Массив из ПолеФормы
	ЭлементыДляЗаполненияВремени.Добавить(Элементы.ВремяДоставкиС);
	ЭлементыДляЗаполненияВремени.Добавить(Элементы.ВремяДоставкиПо);
	ЭлементыДляЗаполненияВремени.Добавить(Элементы.ТоварыКДоставкеВремяДоставкиС);
	ЭлементыДляЗаполненияВремени.Добавить(Элементы.ТоварыКДоставкеВремяДоставкиПо);
	ДоставкаТоваровКлиентСервер.ЗаполнитьСписокВыбораПоляВремени(ЭлементыДляЗаполненияВремени);
	
	УстановитьУсловноеОформление();
	
	Если ТолькоПросмотр Тогда
		
		ИменаЭлементов = Новый Массив; // Массив из Строка
		ИменаЭлементов.Добавить("СпособУказанияДоставки");
		ИменаЭлементов.Добавить("ВидПланированияДоставки");
		
		// На весь документ
		ИменаЭлементов.Добавить("СпособДоставки");
		ИменаЭлементов.Добавить("Курьер");
		ИменаЭлементов.Добавить("ТочкаДоставки");
		ИменаЭлементов.Добавить("ЗонаДоставки");
		ИменаЭлементов.Добавить("ВремяДоставкиС");
		ИменаЭлементов.Добавить("ВремяДоставкиПо");
		ИменаЭлементов.Добавить("ДоставкаДоПеревозчика");
		ИменаЭлементов.Добавить("Перевозчик");
		ИменаЭлементов.Добавить("ТочкаДоставкиПеревозчика");
		ИменаЭлементов.Добавить("ЗонаДоставкиПеревозчика");
		ИменаЭлементов.Добавить("ДополнительнаяИнформацияПоДоставке");
		ИменаЭлементов.Добавить("ОсобыеУсловияПеревозки");
		ИменаЭлементов.Добавить("ОсобыеУсловияПеревозкиОписание");
		
		// Построчно
		ИменаЭлементов.Добавить("ТоварыКДоставке");
		ИменаЭлементов.Добавить("ТоварыКДоставкеВремяДоставкиС");
		ИменаЭлементов.Добавить("ТоварыКДоставкеВремяДоставкиПо");
		ИменаЭлементов.Добавить("ТоварыКДоставкеДоставкаДоПеревозчика");
		ИменаЭлементов.Добавить("ТоварыКДоставкеПеревозчик");
		ИменаЭлементов.Добавить("ТоварыКДоставкеТочкаДоставкиПеревозчика");
		ИменаЭлементов.Добавить("ТоварыКДоставкеЗонаДоставкиПеревозчика");
		ИменаЭлементов.Добавить("ТоварыКДоставкеДополнительнаяИнформацияПоДоставке");
		ИменаЭлементов.Добавить("ТоварыКДоставкеОсобыеУсловияПеревозки");
		ИменаЭлементов.Добавить("ТоварыКДоставкеОсобыеУсловияПеревозкиОписание");
		
		// Склады
		ИменаЭлементов.Добавить("Склады");
		
		ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
			Элементы,
			ИменаЭлементов,
			"ТолькоПросмотр",
			Истина,
			Истина);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СпособУказанияДоставкиПриИзменении(Элемент)
	
	СпособУказанияДоставкиПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПланированияДоставкиПриИзменении(Элемент)
	
	ВидПланированияДоставкиПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура СпособДоставкиПриИзменении(Элемент)
	
	СпособДоставкиПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура СпособДоставкиОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкаДоставкиПриИзменении(Элемент)
	
	Если Объект.ТочкаДоставки.Пустая() Тогда
		
		Объект.ЗонаДоставки = ПредопределенноеЗначение("Справочник.ЗоныДоставки.ПустаяСсылка");
		
	Иначе
		
		Объект.ЗонаДоставки = ЗонаТочкиДоставки(Объект.ТочкаДоставки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоставкаДоПеревозчикаПриИзменении(Элемент)
	
	Если НЕ Объект.ДоставкаДоПеревозчика Тогда
		
		Объект.Перевозчик = ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка");
		Объект.ТочкаДоставкиПеревозчика = ПредопределенноеЗначение("Справочник.ТочкиДоставки.ПустаяСсылка");
		Объект.ЗонаДоставкиПеревозчика = ПредопределенноеЗначение("Справочник.ЗоныДоставки.ПустаяСсылка");
		
	КонецЕсли;
	
	УстановитьВидимостьДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОсобыеУсловияПеревозкиПриИзменении(Элемент)
	
	Элементы.ОсобыеУсловияПеревозкиОписание.ТолькоПросмотр = НЕ Объект.ОсобыеУсловияПеревозки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеревозчикПриИзменении(Элемент)
	
	ДанныеПеревозчика = СведенияТочкиДоставкиПоВладельцу(Объект.Перевозчик);
	Объект.ТочкаДоставкиПеревозчика = ДанныеПеревозчика.ТочкаДоставки;
	Объект.ЗонаДоставкиПеревозчика = ДанныеПеревозчика.ЗонаДоставки;
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкаДоставкиПеревозчикаПриИзменении(Элемент)
	
	Если Объект.ТочкаДоставкиПеревозчика.Пустая() Тогда
		
		Объект.ЗонаДоставкиПеревозчика = ПредопределенноеЗначение("Справочник.ЗоныДоставки.ПустаяСсылка");
		
	Иначе
		
		Объект.ЗонаДоставкиПеревозчика = ЗонаТочкиДоставки(Объект.ТочкаДоставкиПеревозчика);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКДоставкеДоставкаДоПеревозчикаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТоварыКДоставке.ТекущиеДанные;
	
	Если НЕ Объект.ДоставкаДоПеревозчика Тогда
		
		ТекущиеДанные.Перевозчик = ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка");
		ТекущиеДанные.ТочкаДоставкиПеревозчика = ПредопределенноеЗначение("Справочник.ТочкиДоставки.ПустаяСсылка");
		ТекущиеДанные.ЗонаДоставкиПеревозчика = ПредопределенноеЗначение("Справочник.ЗоныДоставки.ПустаяСсылка");
		
	КонецЕсли;
	
	СтрокаДоставки = ДоставкаТоваровКлиентСервер.НовыеДанныеСтрокиДоставки();
	ЗаполнитьЗначенияСвойств(СтрокаДоставки, ТекущиеДанные);
	УстановитьВидимостьДоступностьЭлементовСведенийСтрокиДоставки(СтрокаДоставки);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКДоставкеПеревозчикПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТоварыКДоставке.ТекущиеДанные;
	
	ДанныеПеревозчика = СведенияТочкиДоставкиПоВладельцу(ТекущиеДанные.Перевозчик);
	ТекущиеДанные.ТочкаДоставкиПеревозчика = ДанныеПеревозчика.ТочкаДоставки;
	ТекущиеДанные.ЗонаДоставкиПеревозчика = ДанныеПеревозчика.ЗонаДоставки;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКДоставкеТочкаДоставкиПеревозчикаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТоварыКДоставке.ТекущиеДанные;
	
	Если ТекущиеДанные.ТочкаДоставкиПеревозчика.Пустая() Тогда
		
		ТекущиеДанные.ЗонаДоставкиПеревозчика = ПредопределенноеЗначение("Справочник.ЗоныДоставки.ПустаяСсылка");
		
	Иначе
		
		ТекущиеДанные.ЗонаДоставкиПеревозчика = ЗонаТочкиДоставки(ТекущиеДанные.ТочкаДоставкиПеревозчика);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыКДоставкеОсобыеУсловияПеревозкиПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТоварыКДоставке.ТекущиеДанные;
	
	Элементы.ТоварыКДоставкеОсобыеУсловияПеревозкиОписание.ТолькоПросмотр = НЕ ТекущиеДанные.ОсобыеУсловияПеревозки;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТоварыКДоставке

&НаКлиенте
Процедура ТоварыКДоставкеПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ТоварыКДоставкеПриАктивизацииСтрокиОбработчикОжидания", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКДоставкеСпособДоставкиПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТоварыКДоставке.ТекущиеДанные;
	
	Если ТекущиеДанные.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки25.НашимиСилами") Тогда
		
		Если НЕ ТекущиеДанные.ДоставкаДоПеревозчика Тогда
			
			ТекущиеДанные.Перевозчик = ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка");
			ТекущиеДанные.ТочкаДоставкиПеревозчика = ПредопределенноеЗначение("Справочник.ТочкиДоставки.ПустаяСсылка");
			ТекущиеДанные.ЗонаДоставкиПеревозчика = ПредопределенноеЗначение("Справочник.ЗоныДоставки.ПустаяСсылка");
			
		КонецЕсли;
		
	ИначеЕсли ТекущиеДанные.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки25.СиламиПеревозчика") Тогда
		
		ТекущиеДанные.ДоставкаДоПеревозчика = Ложь;
		ТекущиеДанные.ТочкаДоставкиПеревозчика = ПредопределенноеЗначение("Справочник.ТочкиДоставки.ПустаяСсылка");
		ТекущиеДанные.ЗонаДоставкиПеревозчика = ПредопределенноеЗначение("Справочник.ЗоныДоставки.ПустаяСсылка");
		
	ИначеЕсли ТекущиеДанные.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки25.ОпределяетСлужбаДоставки") Тогда
		
		ТекущиеДанные.ДоставкаДоПеревозчика = Ложь;
		ТекущиеДанные.Перевозчик = ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка");
		ТекущиеДанные.ТочкаДоставкиПеревозчика = ПредопределенноеЗначение("Справочник.ТочкиДоставки.ПустаяСсылка");
		ТекущиеДанные.ЗонаДоставкиПеревозчика = ПредопределенноеЗначение("Справочник.ЗоныДоставки.ПустаяСсылка");
		
	Иначе // Самовывоз или пусто
		
		ТекущиеДанные.ТочкаДоставки = ПредопределенноеЗначение("Справочник.ТочкиДоставки.ПустаяСсылка");
		ТекущиеДанные.ЗонаДоставки = ПредопределенноеЗначение("Справочник.ЗоныДоставки.ПустаяСсылка");
		ТекущиеДанные.ДоставкаДоПеревозчика = Ложь;
		ТекущиеДанные.ВремяДоставкиС = Дата(1, 1, 1);
		ТекущиеДанные.ВремяДоставкиПо = Дата(1, 1, 1);
		ТекущиеДанные.Перевозчик = ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка");
		ТекущиеДанные.ТочкаДоставкиПеревозчика = ПредопределенноеЗначение("Справочник.ТочкиДоставки.ПустаяСсылка");
		ТекущиеДанные.ЗонаДоставкиПеревозчика = ПредопределенноеЗначение("Справочник.ЗоныДоставки.ПустаяСсылка");
		ТекущиеДанные.ДополнительнаяИнформацияПоДоставке = "";
		ТекущиеДанные.ОсобыеУсловияПеревозки = Ложь;
		ТекущиеДанные.ОсобыеУсловияПеревозкиОписание = "";
		
	КонецЕсли;
	
	СтрокаДоставки = ДоставкаТоваровКлиентСервер.НовыеДанныеСтрокиДоставки();
	ЗаполнитьЗначенияСвойств(СтрокаДоставки, ТекущиеДанные);
	УстановитьВидимостьДоступностьЭлементовСведенийСтрокиДоставки(СтрокаДоставки);
	
	Если ТекущиеДанные.СпособДоставки <> ПредопределенноеЗначение("Перечисление.СпособыДоставки25.Самовывоз")
		И НЕ ТекущиеДанные.СпособДоставки.Пустая() Тогда
		
		Если ТекущиеДанные.ЗонаДоставки.Пустая()
			И ТекущиеДанные.ТочкаДоставки.Пустая() Тогда
			
			ДанныеПартнера = СведенияТочкиДоставкиПоВладельцу(Объект.Партнер);
			ТекущиеДанные.ТочкаДоставки = ДанныеПартнера.ТочкаДоставки;
			ТекущиеДанные.ЗонаДоставки = ДанныеПартнера.ЗонаДоставки;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКДоставкеСпособДоставкиОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКДоставкеТочкаДоставкиПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТоварыКДоставке.ТекущиеДанные;
	Если ТекущиеДанные.ТочкаДоставки.Пустая() Тогда
		
		ТекущиеДанные.ЗонаДоставки = ПредопределенноеЗначение("Справочник.ЗоныДоставки.ПустаяСсылка");
		
	Иначе
		
		ТекущиеДанные.ЗонаДоставки = ЗонаТочкиДоставки(ТекущиеДанные.ТочкаДоставки);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСклады

&НаКлиенте
Процедура СкладыТочкаСкладаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Склады.ТекущиеДанные;
	Если ТекущиеДанные.ТочкаСклада.Пустая() Тогда
		
		ТекущиеДанные.ЗонаСклада = ПредопределенноеЗначение("Справочник.ЗоныДоставки.ПустаяСсылка");
		
	Иначе
		
		ТекущиеДанные.ЗонаСклада = ЗонаТочкиДоставки(ТекущиеДанные.ТочкаСклада);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Применить(Команда)
	
	Результат = ДоставкаТоваровКлиентСервер.НовыеПараметрыНастройкиДоставки();
	
	Результат.СпособУказанияДоставки = Объект.СпособУказанияДоставки;
	Результат.ВидПланированияДоставки = Объект.ВидПланированияДоставки;
	
	Если Объект.СпособУказанияДоставки = ПредопределенноеЗначение("Перечисление.СпособыУказанияДоставки.НаВесьДокумент") Тогда
		
		Результат.СпособДоставки = Объект.СпособДоставки;
		Результат.ТочкаДоставки = Объект.ТочкаДоставки;
		Результат.ЗонаДоставки = Объект.ЗонаДоставки;
		Результат.ВремяДоставкиС = Объект.ВремяДоставкиС;
		Результат.ВремяДоставкиПо = Объект.ВремяДоставкиПо;
		
		Результат.ОсобыеУсловияПеревозки = Объект.ОсобыеУсловияПеревозки;
		Если Объект.ОсобыеУсловияПеревозки Тогда
			Результат.ОсобыеУсловияПеревозкиОписание = Объект.ОсобыеУсловияПеревозкиОписание;
		Иначе
			Результат.ОсобыеУсловияПеревозкиОписание = "";
		КонецЕсли;
		Результат.ДополнительнаяИнформацияПоДоставке = Объект.ДополнительнаяИнформацияПоДоставке;
		
		Результат.ДоставкаДоПеревозчика = Объект.ДоставкаДоПеревозчика;
		Результат.Перевозчик = Объект.Перевозчик;
		Результат.ТочкаДоставкиПеревозчика = Объект.ТочкаДоставкиПеревозчика;
		Результат.ЗонаДоставкиПеревозчика = Объект.ЗонаДоставкиПеревозчика;
		
		Если Объект.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки25.НашимиСилами") Тогда
			
			Результат.Курьер = ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка");
			
			Если НЕ Объект.ДоставкаДоПеревозчика Тогда
				
				Результат.Перевозчик = ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка");
				Результат.ТочкаДоставкиПеревозчика = ПредопределенноеЗначение("Справочник.ТочкиДоставки.ПустаяСсылка");
				Результат.ЗонаДоставкиПеревозчика = ПредопределенноеЗначение("Справочник.ЗоныДоставки.ПустаяСсылка");
				
			КонецЕсли;
			
		ИначеЕсли Объект.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки25.СиламиПеревозчика") Тогда
			
			Результат.Курьер = ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка");
			Результат.ДоставкаДоПеревозчика = Ложь;
			Результат.ТочкаДоставкиПеревозчика = ПредопределенноеЗначение("Справочник.ТочкиДоставки.ПустаяСсылка");
			Результат.ЗонаДоставкиПеревозчика = ПредопределенноеЗначение("Справочник.ЗоныДоставки.ПустаяСсылка");
			
		ИначеЕсли Объект.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки25.ОпределяетСлужбаДоставки") Тогда
			
			Результат.Курьер = ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка");
			Результат.ДоставкаДоПеревозчика = Ложь;
			Результат.Перевозчик = ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка");
			Результат.ТочкаДоставкиПеревозчика = ПредопределенноеЗначение("Справочник.ТочкиДоставки.ПустаяСсылка");
			Результат.ЗонаДоставкиПеревозчика = ПредопределенноеЗначение("Справочник.ЗоныДоставки.ПустаяСсылка");
			
		ИначеЕсли Объект.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки25.НашКурьер") Тогда
			
			Результат.Курьер = Объект.Курьер;
			
			Результат.ДоставкаДоПеревозчика = Ложь;
			Результат.Перевозчик = ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка");
			Результат.ТочкаДоставкиПеревозчика = ПредопределенноеЗначение("Справочник.ТочкиДоставки.ПустаяСсылка");
			Результат.ЗонаДоставкиПеревозчика = ПредопределенноеЗначение("Справочник.ЗоныДоставки.ПустаяСсылка");
			
			Результат.ОсобыеУсловияПеревозки = Ложь;
			Результат.ОсобыеУсловияПеревозкиОписание = "";
			
		Иначе // Самовывоз или пусто
			
			Результат.Курьер = ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка");
			Результат.ТочкаДоставки = ПредопределенноеЗначение("Справочник.ТочкиДоставки.ПустаяСсылка");
			Результат.ЗонаДоставки = ПредопределенноеЗначение("Справочник.ЗоныДоставки.ПустаяСсылка");
			Результат.ДоставкаДоПеревозчика = Ложь;
			Результат.ВремяДоставкиС = Дата(1, 1, 1);
			Результат.ВремяДоставкиПо = Дата(1, 1, 1);
			Результат.Перевозчик = ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка");
			Результат.ТочкаДоставкиПеревозчика = ПредопределенноеЗначение("Справочник.ТочкиДоставки.ПустаяСсылка");
			Результат.ЗонаДоставкиПеревозчика = ПредопределенноеЗначение("Справочник.ЗоныДоставки.ПустаяСсылка");
			Результат.ДополнительнаяИнформацияПоДоставке = "";
			Результат.ОсобыеУсловияПеревозки = Ложь;
			Результат.ОсобыеУсловияПеревозкиОписание = "";
			
		КонецЕсли;
		
	Иначе
		
		Результат.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки25.ПустаяСсылка");
		Результат.ТочкаДоставки = ПредопределенноеЗначение("Справочник.ТочкиДоставки.ПустаяСсылка");
		Результат.ЗонаДоставки = ПредопределенноеЗначение("Справочник.ЗоныДоставки.ПустаяСсылка");
		Результат.ВремяДоставкиС = Дата(1, 1, 1);
		Результат.ВремяДоставкиПо = Дата(1, 1, 1);
		
		Результат.ОсобыеУсловияПеревозки = Ложь;
		Результат.ОсобыеУсловияПеревозкиОписание = "";
		
		Результат.ДоставкаДоПеревозчика = Ложь;
		Результат.Перевозчик = ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка");
		Результат.ТочкаДоставкиПеревозчика = ПредопределенноеЗначение("Справочник.ТочкиДоставки.ПустаяСсылка");
		Результат.ЗонаДоставкиПеревозчика = ПредопределенноеЗначение("Справочник.ЗоныДоставки.ПустаяСсылка");
		Результат.ДополнительнаяИнформацияПоДоставке = "";
		
		Для Каждого СтрокаТоваров Из Объект.ТоварыКДоставке Цикл
			
			НоваяСтрока = ДоставкаТоваровКлиентСервер.НовыеДанныеСтрокиДоставки();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТоваров);
			Если НЕ НоваяСтрока.ОсобыеУсловияПеревозки Тогда
				НоваяСтрока.ОсобыеУсловияПеревозкиОписание = "";
			КонецЕсли;
			
			Результат.Товары.Добавить(НоваяСтрока);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Объект.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки25.НашКурьер") Тогда
		Результат.Курьер = Объект.Курьер;
	Иначе
		Результат.Курьер = ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка");
	КонецЕсли;
	
	Для Каждого СтрокаСкладов Из Объект.Склады Цикл
		
		НоваяСтрока = ДоставкаТоваровКлиентСервер.НовыеДанныеСтрокиСкладовДоставки();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСкладов);
		Результат.Склады.Добавить(НоваяСтрока);
		
	КонецЦикла;
	
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроверкаПередачиСпособовДоставки(Знач НастройкиДоставки)
	
	КоличествоИспользуемыхСпособовДоставки = НастройкиДоставки.ИспользуемыеСпособыДоставки.Количество();
	КоличествоИсключаемыхСпособовДоставки = НастройкиДоставки.ИсключаемыеСпособыДоставки.Количество();
	
	ЗаданыОбаВариантаСпособовДоставки =
		(КоличествоИспользуемыхСпособовДоставки > 0
		 И КоличествоИсключаемыхСпособовДоставки > 0);
	НеЗаданыВариантыСпособовДоставки =
		(КоличествоИспользуемыхСпособовДоставки = 0
		 И КоличествоИсключаемыхСпособовДоставки = 0);
	
	//@skip-check module-nstr-camelcase
	ТекстСообщенияНеЗаданы = НСтр("ru = 'Одновременно не заданы ИспользуемыеСпособыДоставки и ИсключаемыеСпособыДоставки'");
	//@skip-check module-nstr-camelcase
	ТекстСообщенияЗаданы = НСтр("ru = 'Одновременно заданы ИспользуемыеСпособыДоставки и ИсключаемыеСпособыДоставки'");
	//@skip-check module-nstr-camelcase
	КонтекстСообщения = НСтр("ru = 'РедактированиеПараметровДоставки.ПараметрыДоставки.ПриСозданииНаСервере'");
	
	ОбщегоНазначенияКлиентСервер.Проверить(
		ЗаданыОбаВариантаСпособовДоставки = Ложь,
		ТекстСообщенияНеЗаданы,
		КонтекстСообщения);
	
	ОбщегоНазначенияКлиентСервер.Проверить(
		НеЗаданыВариантыСпособовДоставки = Ложь,
		ТекстСообщенияЗаданы,
		КонтекстСообщения);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполнитьДанныеДоставкиНаВесьДокумент()
	
	Если Объект.СпособУказанияДоставки <> Перечисления.СпособыУказанияДоставки.НаВесьДокумент Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Объект.ТочкаДоставки.Пустая() Тогда
		
		ВладелецТочкиДоставки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ТочкаДоставки, "Владелец");
		Если ВладелецТочкиДоставки <> Объект.Партнер Тогда
			
			Объект.ТочкаДоставки = Справочники.ТочкиДоставки.ПустаяСсылка();
			Объект.ЗонаДоставки = Справочники.ЗоныДоставки.ПустаяСсылка();
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Если зона доставки не заполнена (проверяем первично) и не заполнена точка доставки,
	// то заполняем точку доставки и по ней данные зоны доставки.
	// Если же зона заполнена, то точку доставки не заполняем
	
	Если Объект.ЗонаДоставки.Пустая()
		И Объект.ТочкаДоставки.Пустая() Тогда
		
		ДанныеТочкиДоставки = Справочники.ТочкиДоставки.СведенияТочкиДоставкиОсновная(Объект.Партнер);
		Объект.ТочкаДоставки = ДанныеТочкиДоставки.ТочкаДоставки;
		Объект.ЗонаДоставки = ДанныеТочкиДоставки.ЗонаДоставки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполнитьДанныеДоставкиПострочно()
	
	Если Объект.СпособУказанияДоставки <> Перечисления.СпособыУказанияДоставки.ПоСтрокам Тогда
		Возврат;
	КонецЕсли;
	
	ТочкиДоставки = Объект.ТоварыКДоставке.Выгрузить(, "ТочкаДоставки").ВыгрузитьКолонку("ТочкаДоставки"); // Массив из СправочникСсылка.ТочкиДоставки
	Если НЕ Объект.ТочкаДоставки.Пустая() Тогда
		ТочкиДоставки.Добавить(Объект.ТочкаДоставки);
	КонецЕсли;
	ВладельцыТочекДоставки = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ТочкиДоставки, "Владелец");
	
	ДанныеТочкиДоставки = Справочники.ТочкиДоставки.СведенияТочкиДоставкиОсновная(Объект.Партнер);
	
	Для Каждого СтрокаТоваров Из Объект.ТоварыКДоставке Цикл
		
		Если СтрокаТоваров.СпособДоставки = Перечисления.СпособыДоставки25.Самовывоз Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаТоваров.СпособДоставки.Пустая() Тогда
			
			СтрокаТоваров.СпособДоставки = Объект.СпособДоставки;
			СтрокаТоваров.ТочкаДоставки = Объект.ТочкаДоставки;
			СтрокаТоваров.ЗонаДоставки = Объект.ЗонаДоставки;
			СтрокаТоваров.ДоставкаДоПеревозчика = Объект.ДоставкаДоПеревозчика;
			СтрокаТоваров.Перевозчик = Объект.Перевозчик;
			СтрокаТоваров.ТочкаДоставкиПеревозчика = Объект.ТочкаДоставкиПеревозчика;
			СтрокаТоваров.ЗонаДоставкиПеревозчика = Объект.ЗонаДоставкиПеревозчика;
			
		КонецЕсли;
		
		Если НЕ СтрокаТоваров.ТочкаДоставки.Пустая()
			И Объект.Партнер <> ВладельцыТочекДоставки[СтрокаТоваров.ТочкаДоставки] Тогда
			
			СтрокаТоваров.ТочкаДоставки = Справочники.ТочкиДоставки.ПустаяСсылка();
			СтрокаТоваров.ЗонаДоставки = Справочники.ЗоныДоставки.ПустаяСсылка();
			
		КонецЕсли;
		
		// Если зона доставки не заполнена (проверяем первично) и не заполнена точка доставки,
		// то заполняем точку доставки и по ней данные зоны доставки.
		// Если же зона заполнена, то точку доставки не заполняем
		
		Если СтрокаТоваров.ЗонаДоставки.Пустая()
			И СтрокаТоваров.ТочкаДоставки.Пустая() Тогда
			
			СтрокаТоваров.ТочкаДоставки = ДанныеТочкиДоставки.ТочкаДоставки;
			СтрокаТоваров.ЗонаДоставки = ДанныеТочкиДоставки.ЗонаДоставки;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьОграниченияСпособовДоставки(НастройкиДоставки)
	
	Если НастройкиДоставки.ИспользуемыеСпособыДоставки.Количество() > 0 Тогда
		
		// Указание на весь документ
		ИспользуемыеСпособыДоставки = ОбщегоНазначения.СкопироватьРекурсивно(НастройкиДоставки.ИспользуемыеСпособыДоставки);
		ИспользуемыеСпособыДоставкиБезКурьера = ОбщегоНазначения.СкопироватьРекурсивно(ИспользуемыеСпособыДоставки);
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(
			ИспользуемыеСпособыДоставкиБезКурьера,
			Перечисления.СпособыДоставки25.НашКурьер);
		СпособыДоставкиШапки.ЗагрузитьЗначения(ИспользуемыеСпособыДоставки);
		
		// Указание списком, всегда исключается вариант НашКурьер
		ПараметрыВыбора = Новый Массив; // Массив из ПараметрВыбора
		ПараметрВыбора = Новый ПараметрВыбора(
			"Отбор.Ссылка",
			Новый ФиксированныйМассив(ИспользуемыеСпособыДоставкиБезКурьера));
		ПараметрыВыбора.Добавить(ПараметрВыбора);
		
		Элементы.ТоварыКДоставкеСпособДоставки.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
		
	КонецЕсли;
	
	Если НастройкиДоставки.ИсключаемыеСпособыДоставки.Количество() > 0 Тогда
		
		// Указание на весь документ 
		ИсключаемыеСпособыДоставкиШапки = ОбщегоНазначения.СкопироватьРекурсивно(НастройкиДоставки.ИсключаемыеСпособыДоставки);
		ИсключаемыеСпособыДоставкиШапки.Добавить(Перечисления.СпособыДоставки25.Самовывоз);
		ИсключаемыеСпособыДоставкиШапки = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ИсключаемыеСпособыДоставкиШапки);
		
		ПараметрыВыбораСпособов = Новый Структура;
		ПараметрыВыбораСпособов.Вставить("ИсключаемыеЗначения", ИсключаемыеСпособыДоставкиШапки);
		СпособыДоставкиШапки = Перечисления.СпособыДоставки25.ПолучитьДанныеВыбора(ПараметрыВыбораСпособов);
		
		// Указание списком, всегда исключается вариант НашКурьер
		ИспользуемыеСпособыДоставкиБезКурьера = ОбщегоНазначения.СкопироватьРекурсивно(НастройкиДоставки.ИсключаемыеСпособыДоставки);
		ИспользуемыеСпособыДоставкиБезКурьера.Добавить(Перечисления.СпособыДоставки25.НашКурьер);
		
		ПараметрыВыбора = Новый Массив; // Массив из ПараметрВыбора
		ПараметрВыбора = Новый ПараметрВыбора(
			"ИсключаемыеЗначения",
			Новый ФиксированныйМассив(ИспользуемыеСпособыДоставкиБезКурьера));
		ПараметрыВыбора.Добавить(ПараметрВыбора);
		
		Элементы.ТоварыКДоставкеСпособДоставки.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
		
	КонецЕсли;
	
	// Для шапки всегда исключается способ Самовывоз
	ЭлементСпискаЗначений = СпособыДоставкиШапки.НайтиПоЗначению(Перечисления.СпособыДоставки25.Самовывоз);
	Если ЭлементСпискаЗначений <> Неопределено Тогда
		СпособыДоставкиШапки.Удалить(ЭлементСпискаЗначений);
	КонецЕсли;
	
	// Вспомогательный список способ шапки, но без курьера
	СпособыДоставкиШапкиБезКурьера = ОбщегоНазначения.СкопироватьРекурсивно(СпособыДоставкиШапки);
	ЭлементСпискаЗначений = СпособыДоставкиШапкиБезКурьера.НайтиПоЗначению(Перечисления.СпособыДоставки25.НашКурьер);
	Если ЭлементСпискаЗначений <> Неопределено Тогда
		СпособыДоставкиШапкиБезКурьера.Удалить(ЭлементСпискаЗначений);
	КонецЕсли;
	
	УстановитьПараметрыСпособаДоставкиШапки();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФиксированнуюВидимостьДоступностьЭлементов(НастройкиДоставки)
	
	Элементы.ВидПланированияДоставки.ТолькоПросмотр = НЕ НастройкиДоставки.РазрешитьИзменениеВидаПланированияДоставки;
	Элементы.СпособУказанияДоставки.ТолькоПросмотр = НЕ НастройкиДоставки.РазрешитьИзменениеСпособаУказанияДоставки;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступностьЭлементов()
	
	ИменаВидимыхЭлементов = Новый Массив; // Массив из Строка
	ИменаВсехЭлементов = Новый Массив; // Массив из Строка
	ИменаЭлементовВозможнойОбязательности = Новый Массив; // Массив из Строка
	ИменаОбязательныхЭлементов = Новый Массив; // Массив из Строка
	
	ИменаВсехЭлементов.Добавить(Элементы.СтраницаНаВесьДокумент.Имя);
	ИменаВсехЭлементов.Добавить(Элементы.СтраницаПострочно.Имя);
	ИменаВсехЭлементов.Добавить(Элементы.СпособДоставки.Имя);
	ИменаВсехЭлементов.Добавить(Элементы.Курьер.Имя);
	ИменаВсехЭлементов.Добавить(Элементы.ДоставкаДоПеревозчика.Имя);
	ИменаВсехЭлементов.Добавить(Элементы.Перевозчик.Имя);
	ИменаВсехЭлементов.Добавить(Элементы.ТочкаДоставкиПеревозчика.Имя);
	ИменаВсехЭлементов.Добавить(Элементы.ЗонаДоставкиПеревозчика.Имя);
	ИменаВсехЭлементов.Добавить(Элементы.ВремяДоставкиС.Имя);
	ИменаВсехЭлементов.Добавить(Элементы.ВремяДоставкиПо.Имя);
	ИменаВсехЭлементов.Добавить(Элементы.ДополнительнаяИнформацияПоДоставке.Имя);
	ИменаВсехЭлементов.Добавить(Элементы.ОсобыеУсловияПеревозки.Имя);
	ИменаВсехЭлементов.Добавить(Элементы.ОсобыеУсловияПеревозкиОписание.Имя);
	
	ИменаЭлементовВозможнойОбязательности.Добавить(Элементы.Перевозчик.Имя);
	ИменаЭлементовВозможнойОбязательности.Добавить(Элементы.ТочкаДоставкиПеревозчика.Имя);
	ИменаЭлементовВозможнойОбязательности.Добавить(Элементы.ЗонаДоставкиПеревозчика.Имя);
	
	Если Объект.СпособУказанияДоставки = Перечисления.СпособыУказанияДоставки.НаВесьДокумент Тогда
		
		ИменаВидимыхЭлементов.Добавить(Элементы.СтраницаНаВесьДокумент.Имя);
		ИменаВидимыхЭлементов.Добавить(Элементы.СпособДоставки.Имя);
		ИменаВидимыхЭлементов.Добавить(Элементы.ВремяДоставкиС.Имя);
		ИменаВидимыхЭлементов.Добавить(Элементы.ВремяДоставкиПо.Имя);
		ИменаВидимыхЭлементов.Добавить(Элементы.ДополнительнаяИнформацияПоДоставке.Имя);
		
		Если Объект.СпособДоставки = Перечисления.СпособыДоставки25.НашимиСилами Тогда
			
			ИменаВидимыхЭлементов.Добавить(Элементы.ДоставкаДоПеревозчика.Имя);
			ИменаВидимыхЭлементов.Добавить(Элементы.Перевозчик.Имя);
			ИменаВидимыхЭлементов.Добавить(Элементы.ТочкаДоставкиПеревозчика.Имя);
			ИменаВидимыхЭлементов.Добавить(Элементы.ЗонаДоставкиПеревозчика.Имя);
			
			Если Объект.ДоставкаДоПеревозчика
			   И Объект.ВидПланированияДоставки = Перечисления.ВидыПланированияДоставки.ТекущимДокументом Тогда
				
				ИменаОбязательныхЭлементов.Добавить(Элементы.Перевозчик.Имя);
				ИменаОбязательныхЭлементов.Добавить(Элементы.ТочкаДоставкиПеревозчика.Имя);
				ИменаОбязательныхЭлементов.Добавить(Элементы.ЗонаДоставкиПеревозчика.Имя);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если Объект.СпособДоставки = Перечисления.СпособыДоставки25.СиламиПеревозчика Тогда
			
			ИменаВидимыхЭлементов.Добавить(Элементы.Перевозчик.Имя);
			
			Если Объект.ВидПланированияДоставки = Перечисления.ВидыПланированияДоставки.ТекущимДокументом Тогда
				
				ИменаОбязательныхЭлементов.Добавить(Элементы.Перевозчик.Имя);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если Объект.СпособДоставки = Перечисления.СпособыДоставки25.НашКурьер Тогда
			
			ИменаВидимыхЭлементов.Добавить(Элементы.Курьер.Имя);
			
		Иначе
			
			ИменаВидимыхЭлементов.Добавить(Элементы.ОсобыеУсловияПеревозки.Имя);
			ИменаВидимыхЭлементов.Добавить(Элементы.ОсобыеУсловияПеревозкиОписание.Имя);
		
		КонецЕсли;
		
	КонецЕсли;
	
	Если Объект.СпособУказанияДоставки = Перечисления.СпособыУказанияДоставки.ПоСтрокам Тогда
		
		ИменаВидимыхЭлементов.Добавить(Элементы.СтраницаПострочно.Имя);
		
	КонецЕсли;
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьВидимостьЭлементовПоМассиву(
		Элементы,
		ИменаВсехЭлементов,
		ИменаВидимыхЭлементов);
	
	ИменаНеОбязательныхЭлементов = ОбщегоНазначенияКлиентСервер.РазностьМассивов(
		ИменаЭлементовВозможнойОбязательности,
		ИменаОбязательныхЭлементов);
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
		Элементы,
		ИменаНеОбязательныхЭлементов,
		"АвтоОтметкаНезаполненного",
		Ложь);
		
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
		Элементы,
		ИменаНеОбязательныхЭлементов,
		"ОтметкаНезаполненного",
		Ложь);
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
		Элементы,
		ИменаОбязательныхЭлементов,
		"АвтоОтметкаНезаполненного",
		Истина);
	
	Элементы.ОсобыеУсловияПеревозкиОписание.ТолькоПросмотр = НЕ Объект.ОсобыеУсловияПеревозки;
	
	ДоступныДанныеПеревозчика =
		((Объект.СпособДоставки = Перечисления.СпособыДоставки25.НашимиСилами
		  И Объект.ДоставкаДоПеревозчика)
		 ИЛИ Объект.СпособДоставки = Перечисления.СпособыДоставки25.СиламиПеревозчика);
		
	Элементы.Перевозчик.ТолькоПросмотр = НЕ ДоступныДанныеПеревозчика;
	Элементы.ТочкаДоставкиПеревозчика.ТолькоПросмотр = НЕ ДоступныДанныеПеревозчика;
	Элементы.ЗонаДоставкиПеревозчика.ТолькоПросмотр = НЕ ДоступныДанныеПеревозчика;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКДоставкеПриАктивизацииСтрокиОбработчикОжидания()
	
	ТекущиеДанные = Элементы.ТоварыКДоставке.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаДоставки = ДоставкаТоваровКлиентСервер.НовыеДанныеСтрокиДоставки();
	ЗаполнитьЗначенияСвойств(СтрокаДоставки, ТекущиеДанные);
	УстановитьВидимостьДоступностьЭлементовСведенийСтрокиДоставки(СтрокаДоставки);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступностьЭлементовСведенийСтрокиДоставки(СтрокаДоставки)
	
	ИменаВидимыхЭлементов = Новый Массив; // Массив из Строка
	ИменаВсехЭлементов = Новый Массив; // Массив из Строка
	ИменаОбязательныхЭлементов = Новый Массив; // Массив из Строка
	ИменаЭлементовВозможнойОбязательности = Новый Массив; // Массив из Строка
	
	ИменаВсехЭлементов.Добавить(Элементы.ТоварыКДоставкеВремяДоставкиС.Имя);
	ИменаВсехЭлементов.Добавить(Элементы.ТоварыКДоставкеВремяДоставкиПо.Имя);
	ИменаВсехЭлементов.Добавить(Элементы.ТоварыКДоставкеДоставкаДоПеревозчика.Имя);
	ИменаВсехЭлементов.Добавить(Элементы.ТоварыКДоставкеПеревозчик.Имя);
	ИменаВсехЭлементов.Добавить(Элементы.ТоварыКДоставкеТочкаДоставкиПеревозчика.Имя);
	ИменаВсехЭлементов.Добавить(Элементы.ТоварыКДоставкеЗонаДоставкиПеревозчика.Имя);
	ИменаВсехЭлементов.Добавить(Элементы.ТоварыКДоставкеДополнительнаяИнформацияПоДоставке.Имя);
	ИменаВсехЭлементов.Добавить(Элементы.ТоварыКДоставкеОсобыеУсловияПеревозки.Имя);
	ИменаВсехЭлементов.Добавить(Элементы.ТоварыКДоставкеОсобыеУсловияПеревозкиОписание.Имя);
	
	ИменаЭлементовВозможнойОбязательности.Добавить(Элементы.ТоварыКДоставкеТочкаДоставки.Имя);
	ИменаЭлементовВозможнойОбязательности.Добавить(Элементы.ТоварыКДоставкеЗонаДоставки.Имя);
	ИменаЭлементовВозможнойОбязательности.Добавить(Элементы.ТоварыКДоставкеПеревозчик.Имя);
	ИменаЭлементовВозможнойОбязательности.Добавить(Элементы.ТоварыКДоставкеТочкаДоставкиПеревозчика.Имя);
	ИменаЭлементовВозможнойОбязательности.Добавить(Элементы.ТоварыКДоставкеЗонаДоставкиПеревозчика.Имя);
	
	Если СтрокаДоставки.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки25.НашимиСилами") Тогда
		
		Элементы.СтраницыСведений.ТекущаяСтраница = Элементы.СтраницаЕстьСпособДоставки;
		
		ИменаВидимыхЭлементов.Добавить(Элементы.ТоварыКДоставкеВремяДоставкиС.Имя);
		ИменаВидимыхЭлементов.Добавить(Элементы.ТоварыКДоставкеВремяДоставкиПо.Имя);
		ИменаВидимыхЭлементов.Добавить(Элементы.ТоварыКДоставкеДоставкаДоПеревозчика.Имя);
		ИменаВидимыхЭлементов.Добавить(Элементы.ТоварыКДоставкеПеревозчик.Имя);
		ИменаВидимыхЭлементов.Добавить(Элементы.ТоварыКДоставкеТочкаДоставкиПеревозчика.Имя);
		ИменаВидимыхЭлементов.Добавить(Элементы.ТоварыКДоставкеЗонаДоставкиПеревозчика.Имя);
		ИменаВидимыхЭлементов.Добавить(Элементы.ТоварыКДоставкеДополнительнаяИнформацияПоДоставке.Имя);
		ИменаВидимыхЭлементов.Добавить(Элементы.ТоварыКДоставкеОсобыеУсловияПеревозки.Имя);
		ИменаВидимыхЭлементов.Добавить(Элементы.ТоварыКДоставкеОсобыеУсловияПеревозкиОписание.Имя);
		
		Если Объект.ВидПланированияДоставки = ПредопределенноеЗначение("Перечисление.ВидыПланированияДоставки.ТекущимДокументом") Тогда
			
			ИменаОбязательныхЭлементов.Добавить(Элементы.ТоварыКДоставкеТочкаДоставки.Имя);
			ИменаОбязательныхЭлементов.Добавить(Элементы.ТоварыКДоставкеЗонаДоставки.Имя);
			
			Если СтрокаДоставки.ДоставкаДоПеревозчика Тогда
				
				ИменаОбязательныхЭлементов.Добавить(Элементы.ТоварыКДоставкеПеревозчик.Имя);
				ИменаОбязательныхЭлементов.Добавить(Элементы.ТоварыКДоставкеТочкаДоставкиПеревозчика.Имя);
				ИменаОбязательныхЭлементов.Добавить(Элементы.ТоварыКДоставкеЗонаДоставкиПеревозчика.Имя);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
		
	Если СтрокаДоставки.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки25.СиламиПеревозчика") Тогда
		
		Элементы.СтраницыСведений.ТекущаяСтраница = Элементы.СтраницаЕстьСпособДоставки;
		
		ИменаВидимыхЭлементов.Добавить(Элементы.ТоварыКДоставкеВремяДоставкиС.Имя);
		ИменаВидимыхЭлементов.Добавить(Элементы.ТоварыКДоставкеВремяДоставкиПо.Имя);
		ИменаВидимыхЭлементов.Добавить(Элементы.ТоварыКДоставкеПеревозчик.Имя);
		ИменаВидимыхЭлементов.Добавить(Элементы.ТоварыКДоставкеДополнительнаяИнформацияПоДоставке.Имя);
		ИменаВидимыхЭлементов.Добавить(Элементы.ТоварыКДоставкеОсобыеУсловияПеревозки.Имя);
		ИменаВидимыхЭлементов.Добавить(Элементы.ТоварыКДоставкеОсобыеУсловияПеревозкиОписание.Имя);
		
		Если Объект.ВидПланированияДоставки = ПредопределенноеЗначение("Перечисление.ВидыПланированияДоставки.ТекущимДокументом") Тогда
			
			ИменаОбязательныхЭлементов.Добавить(Элементы.ТоварыКДоставкеТочкаДоставки.Имя);
			ИменаОбязательныхЭлементов.Добавить(Элементы.ТоварыКДоставкеЗонаДоставки.Имя);
			ИменаОбязательныхЭлементов.Добавить(Элементы.ТоварыКДоставкеПеревозчик.Имя);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтрокаДоставки.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки25.Самовывоз") Тогда
		
		Элементы.СтраницыСведений.ТекущаяСтраница = Элементы.СтраницаСамовывоз;
		
	КонецЕсли;
	
	Если СтрокаДоставки.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки25.ОпределяетСлужбаДоставки") Тогда
		
		Элементы.СтраницыСведений.ТекущаяСтраница = Элементы.СтраницаЕстьСпособДоставки;
		
		ИменаВидимыхЭлементов.Добавить(Элементы.ТоварыКДоставкеВремяДоставкиС.Имя);
		ИменаВидимыхЭлементов.Добавить(Элементы.ТоварыКДоставкеВремяДоставкиПо.Имя);
		ИменаВидимыхЭлементов.Добавить(Элементы.ТоварыКДоставкеДополнительнаяИнформацияПоДоставке.Имя);
		ИменаВидимыхЭлементов.Добавить(Элементы.ТоварыКДоставкеОсобыеУсловияПеревозки.Имя);
		ИменаВидимыхЭлементов.Добавить(Элементы.ТоварыКДоставкеОсобыеУсловияПеревозкиОписание.Имя);
		
		ИменаОбязательныхЭлементов.Добавить(Элементы.ТоварыКДоставкеТочкаДоставки.Имя);
		ИменаОбязательныхЭлементов.Добавить(Элементы.ТоварыКДоставкеЗонаДоставки.Имя);
		
	КонецЕсли;
	
	Если СтрокаДоставки.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки25.ПустаяСсылка") Тогда
		
		Элементы.СтраницыСведений.ТекущаяСтраница = Элементы.СтраницаНетСпособаДоставки;
		
	КонецЕсли;
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьВидимостьЭлементовПоМассиву(
		Элементы,
		ИменаВсехЭлементов,
		ИменаВидимыхЭлементов);
	
	ИменаНеОбязательныхЭлементов = ОбщегоНазначенияКлиентСервер.РазностьМассивов(
		ИменаЭлементовВозможнойОбязательности,
		ИменаОбязательныхЭлементов);
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
		Элементы,
		ИменаНеОбязательныхЭлементов,
		"АвтоОтметкаНезаполненного",
		Ложь);
		
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
		Элементы,
		ИменаНеОбязательныхЭлементов,
		"ОтметкаНезаполненного",
		Ложь);
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
		Элементы,
		ИменаОбязательныхЭлементов,
		"АвтоОтметкаНезаполненного",
		Истина);
	
	Элементы.ТоварыКДоставкеОсобыеУсловияПеревозкиОписание.ТолькоПросмотр = НЕ СтрокаДоставки.ОсобыеУсловияПеревозки;
	
	ДоступныДанныеПеревозчика =
		((СтрокаДоставки.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки25.НашимиСилами")
		  И СтрокаДоставки.ДоставкаДоПеревозчика)
		 ИЛИ СтрокаДоставки.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки25.СиламиПеревозчика"));
	
	Элементы.ТоварыКДоставкеПеревозчик.ТолькоПросмотр = НЕ ДоступныДанныеПеревозчика;
	Элементы.ТоварыКДоставкеТочкаДоставкиПеревозчика.ТолькоПросмотр = НЕ ДоступныДанныеПеревозчика;
	Элементы.ТоварыКДоставкеЗонаДоставкиПеревозчика.ТолькоПросмотр = НЕ ДоступныДанныеПеревозчика;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СведенияТочкиДоставкиПоВладельцу(Знач ВладелецТочкиДоставки)
	
	Возврат Справочники.ТочкиДоставки.СведенияТочкиДоставкиОсновная(ВладелецТочкиДоставки);
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗонаТочкиДоставки(Знач ТочкаДоставки)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТочкаДоставки, "ЗонаДоставки");
	
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	НоменклатураСервер.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(
		ЭтотОбъект,
		Элементы.ТоварыКДоставкеХарактеристика.Имя,
		"Объект.ТоварыКДоставке.ХарактеристикиИспользуются");
	
	ДополнительныеПараметры = НоменклатураСервер.НовыеПараметрыУсловногоОформленияЕдиницИзмерения();
	ДополнительныеПараметры.ИмяПоляЕдиницаИзмерения = Элементы.ТоварыКДоставкеНоменклатураЕдиницаИзмерения.Имя;
	ДополнительныеПараметры.ПутьКПолюУпаковка = "Объект.ТоварыКДоставке.Упаковка";
	НоменклатураСервер.УстановитьУсловноеОформлениеЕдиницИзмерения(
		ЭтотОбъект,
		ДополнительныеПараметры);
	
	НоменклатураСервер.УстановитьУсловноеОформлениеСерийНоменклатуры(
		ЭтотОбъект,
		"СерииВсегдаВТЧТовары",
		Элементы.ТоварыКДоставкеСерия.Имя,
		"Объект.ТоварыКДоставке.СтатусУказанияСерий",
		"Объект.ТоварыКДоставке.ТипНоменклатуры");
	
	#Область СпособДоставкиПустой
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыКДоставкеТочкаДоставки.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыКДоставкеЗонаДоставки.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ТоварыКДоставке.СпособДоставки");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.СпособыДоставки25.ПустаяСсылка();
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<укажите способ доставки>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	#КонецОбласти
	
	#Область СпособДоставкиСамовывоз
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыКДоставкеТочкаДоставки.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыКДоставкеЗонаДоставки.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ТоварыКДоставке.СпособДоставки");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.СпособыДоставки25.Самовывоз;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<не требуется>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	#КонецОбласти
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыСпособаДоставкиШапки()
	
	ПараметрыВыбора = Новый Массив; // Массив из ПараметрВыбора
	
	Если Объект.СпособУказанияДоставки = Перечисления.СпособыУказанияДоставки.НаВесьДокумент
	   И Объект.ВидПланированияДоставки = Перечисления.ВидыПланированияДоставки.ТекущимДокументом Тогда
		
		ПараметрВыбора = Новый ПараметрВыбора(
			"Отбор.Ссылка",
			Новый ФиксированныйМассив(СпособыДоставкиШапки.ВыгрузитьЗначения()));
		
	Иначе
		
		ПараметрВыбора = Новый ПараметрВыбора(
			"Отбор.Ссылка",
			Новый ФиксированныйМассив(СпособыДоставкиШапкиБезКурьера.ВыгрузитьЗначения()));
		
		Если Объект.СпособДоставки = Перечисления.СпособыДоставки25.НашКурьер Тогда
			
			Объект.СпособДоставки = Перечисления.СпособыДоставки25.ПустаяСсылка();
			СпособДоставкиПриИзмененииСервер();
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыВыбора.Добавить(ПараметрВыбора);
	
	Элементы.СпособДоставки.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
	
КонецПроцедуры

#Область ОбработчикиСобытийЭлементовШапкиФормыВспомогательные

&НаСервере
Процедура СпособУказанияДоставкиПриИзмененииСервер()
	
	УстановитьПараметрыСпособаДоставкиШапки();
	УстановитьВидимостьДоступностьЭлементов();
	ПроверитьЗаполнитьДанныеДоставкиНаВесьДокумент();
	ПроверитьЗаполнитьДанныеДоставкиПострочно();
	
КонецПроцедуры

&НаСервере
Процедура ВидПланированияДоставкиПриИзмененииСервер()
	
	УстановитьПараметрыСпособаДоставкиШапки();
	УстановитьВидимостьДоступностьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура СпособДоставкиПриИзмененииСервер()
	
	Если Объект.СпособДоставки <> Перечисления.СпособыДоставки25.НашимиСилами Тогда
		
		Объект.ДоставкаДоПеревозчика = Ложь;
		
	КонецЕсли;
	
	Если Объект.СпособДоставки <> Перечисления.СпособыДоставки25.НашимиСилами
	   И Объект.СпособДоставки <> Перечисления.СпособыДоставки25.СиламиПеревозчика Тогда
		
		Объект.Перевозчик = Справочники.Партнеры.ПустаяСсылка();
		Объект.ТочкаДоставкиПеревозчика = Справочники.ТочкиДоставки.ПустаяСсылка();
		Объект.ЗонаДоставкиПеревозчика = Справочники.ЗоныДоставки.ПустаяСсылка();
		
	КонецЕсли;
	
	Если Объект.СпособДоставки = Перечисления.СпособыДоставки25.НашКурьер Тогда
		
		Объект.ОсобыеУсловияПеревозки = Ложь;
		Объект.ОсобыеУсловияПеревозкиОписание = "";
		
	Иначе
		
		Объект.Курьер = Справочники.ФизическиеЛица.ПустаяСсылка();
		
	КонецЕсли;
	
	УстановитьВидимостьДоступностьЭлементов();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
